app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    @album.user = @current_user

    if @album.save
---
INSERT INTO "albums" ("title", "artist", "genre", "vendor", "condition", "cost", "purchased", "released", "user_id", "created_at", "updated_at", "cover_url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    if @album.update(album_params)
---
UPDATE "albums" SET "cost" = $1, "purchased" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["cost", "$20.00"], ["purchased", 2015], ["updated_at", "2021-12-15 14:28:52.828711"], ["id", 4]]

  def destroy
    @album.destroy
---
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 5]]