app/controllers/notes_controller.rb

  def create
    @album = Album.find(params[:album_id])
    @note = Note.new(note_params)
    @note.user = @current_user
    @note.album = @album

    if @note.save
---
SELECT "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "notes" ("title", "desciption", "user_id", "album_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "one last time"], ["desciption", "one last time"], ["user_id", 2], ["album_id", 1], ["created_at", "2021-12-13 00:39:16.013151"], ["updated_at", "2021-12-13 00:39:16.013151"]]